[{"position":"Software Architect","picture_url":"/system/pictures/42/thumb/danallen.jpg?1295286912","session_ids":[13],"id":1000,"last_name":"Smith","name":"Steve Smith","bio":"I like Pina Coladas and getting caught in the rain.","twitter":"@stevenpsmith123","first_name":"Steve "}, {"position":"Principal Software Engineer, JBoss","picture_url":"/system/pictures/42/thumb/danallen.jpg?1295286912","session_ids":[13],"id":42,"last_name":"Allen","name":"Dan  Allen","bio":"<p>As Principal Software Engineer at JBoss, by Red Hat, Dan works as the community liaison and contributor for the Seam, Weld and Arquillian projects. He&#8217;s the author of Seam in Action (Manning), served as a representative for Red Hat on the <span class=\"caps\">JSR</span>-314 Expert Group (<span class=\"caps\">JSF</span> 2.0), writes for <span class=\"caps\">IBM</span> developerWorks and <span class=\"caps\">NFJS</span> magazine and is an internationally recognized speaker, appearing at major industry conferences including JavaOne, Devoxx, <span class=\"caps\">NFJS</span>, <span class=\"caps\">JAX</span> and Jazoon. In 2009, he was added to the JavaOne Rock Star Hall of Fame for his talk &#8220;Conversations and pageflows on the <span class=\"caps\">JSF</span> platform&#8221; and was named a JBossWorld Top Rated Presenter that same year.<br />\nYou can keep up with Dan&#8217;s discoveries by reading his blogs at http://mojavelinux.com and http://community.jboss.org/people/dan.j.allen/blog or tracking what he&#8217;s currently up to by following him on Twitter at http://twitter.com/mojavelinux.</p>","twitter":"@mojavelinux","first_name":"Dan "},{"position":"JRuby Core Team Member; creator of Ioke","picture_url":"/system/pictures/20/thumb/HeadshotMedium.JPG?1292613209","session_ids":[3],"id":20,"last_name":"Bini","name":"Ola Bini","bio":"<p>Ola Bini works as a language geek for ThoughtWorks in Chicago. He is from Sweden but don&#8217;t hold that against him. He is one of the JRuby core developers and have been involved in JRuby development since 2006. At one point in time, Ola got tired of all existing programming languages and decided to create his own, called Ioke. Then he did it again, and started work on Seph. He has written a book called Practical JRuby on Rails Projects for APress, and coauthered Using JRuby for the Pragmatic Programmers, talked at numerous conferences, and contributed to a large amount of open source projects. He is also a member of the JSR292 Expert Group.</p>\n<p>His main passion lies in implementation languages, working on regular expression engines and trying to figure out how to create good <span class=\"caps\">YAML</span> parsers.</p>","twitter":"@olabini","first_name":"Ola"},{"position":"author of Ruby for Rails and The Well-Grounded Rubyist","picture_url":"/system/pictures/21/thumb/davidblack.jpg?1292538354","session_ids":[],"id":21,"last_name":"Black","name":"David A. Black","bio":"<p>David A. Black is a Senior Developer at Cyrus Innovation, Inc., and a well-known and highly-regarded Ruby and Rails programmer, author, and trainer. Active in the Ruby world since 2000, David has more than a decade of full-time teaching experience, and is the author of The Well-Grounded Rubyist (Manning Publications, 2009). He has been interviewed for InfoQ and the Rails Podcast; has co-organized numerous Ruby/Rails conferences; and has spoken at conferences and Ruby/Rails users groups in the United States, Canada, and Europe. David is also a founding director of Ruby Central, Inc., the parent organization of RubyConf and RailsConf.</p>","twitter":"@david_a_black","first_name":"David A."},{"position":"Lead Architect, Visibiz","picture_url":"/system/pictures/41/thumb/mikebrocious.jpg?1294850984","session_ids":[17],"id":41,"last_name":"Brocious","name":"Mike Brocious","bio":"<p>Mike Brocious is Lead Architect at Visibiz, a business development solution for small businesses that incorporates networking activities, social infusion, intelligence, and workflow into traditional <span class=\"caps\">CRM</span>.  He is happily immersed in Grails, MongoDB, and jQuery while learning the ropes at a startup.</p>\n<p>Prior to joining Visibiz, Mike held a number of engineering and management positions at Siemens Healthcare where he worked on everything from the mainframe to OS/2 to Windows and Unix. He helped introduce the use of Internet technology for healthcare applications at Siemens and he was lead architect for the company’s web-based single sign-on portal. Mike has presented architecture and design related topics at numerous internal and external forums.</p>\n<p>Mike pretends to have a life outside of technology, so he spends time with his wife, kids and dogs. A big fan of endurance sports, he enjoys torturing himself with long trail runs, mountain bike rides or anything else that gets him outdoors and moving fast.</p>","twitter":"","first_name":"Mike"},{"position":"Sr. Director of Advanced Applications Engineering for Comcast Interactive Media","picture_url":"/pictures/thumb/missing.png","session_ids":[],"id":22,"last_name":"Brown","name":"Sean  Brown","bio":"<p>coming soon</p>","twitter":"","first_name":"Sean "},{"position":"Senior Software Architect, Comcast Interactive Media","picture_url":"/system/pictures/11/thumb/josephcampbell.jpg?1292518251","session_ids":[6],"id":11,"last_name":"Campbell","name":"Joseph Campbell","bio":"<p>Joe Campbell recently joined Comcast Interactive Media (<span class=\"caps\">CIM</span>), a division of Comcast Corporation as a Senior Software Architect from <span class=\"caps\">ING</span> Direct fsb in Wilmington Delaware.  He works with business and development teams to help <span class=\"caps\">CIM</span> develop innovative online and cross-platform products focused on entertainment and media which currently includes websites like: Comcast.net, Fancast.com, Xfinity.com and mobile applications like the <span class=\"caps\">XFINITY</span> TV iPad application.</p>","twitter":"@joercampbell","first_name":"Joseph"},{"position":"RSpec Lead Developer","picture_url":"/system/pictures/36/thumb/newdavidchleimsky.jpg?1294323518","session_ids":[],"id":36,"last_name":"Chelimsky","name":"David Chelimsky","bio":"<p>David Chelimsky is co-author of The RSpec Book, released in December of 2010, the lead developer/maintainer of RSpec, and has contributed to several other open source projects including Cucumber, Aruba, and Rails. He has been developing software for over a decade, including three years training and mentoring agile teams at Object Mentor. He is currently a Senior Software Engineer at <span class=\"caps\">DRW</span> Trading Group in Chicago, IL. In his spare time, David likes to play guitar, travel, and speak something resembling Portuguese.</p>","twitter":"","first_name":"David"},{"position":"author of Tapworthy: Designing iPhone Interfaces for Delight and Usability","picture_url":"/system/pictures/1/thumb/josh_clark_1612x1802.jpg?1292517601","session_ids":[15],"id":1,"last_name":"Clark","name":"Josh Clark","bio":"<p>Josh Clark is a designer specializing in mobile design strategy and user experience. He&#8217;s author of the O&#8217;Reilly books &#8220;Tapworthy: Designing Great iPhone Apps&#8221; and &#8220;Best iPhone Apps.&#8221; Josh&#8217;s outfit Global Moxie offers consulting services and workshops to help media companies, design agencies, and creative organizations build tapworthy mobile apps and effective websites.</p>\n<p>Before the interwebs swallowed him up, Josh worked on a slew of national <span class=\"caps\">PBS</span> programs at Boston&#8217;s <span class=\"caps\">WGBH</span>. He shared his three words of Russian with Mikhail Gorbachev, strolled the ranch with Nancy Reagan, hobnobbed with Rockefellers, and wrote trivia questions for a primetime game show. In 1996, he created the uberpopular &#8220;Couch-to-5K&#8221; (C25K) running program, which has helped millions of skeptical would-be exercisers take up jogging. (His motto is the same for fitness as it is for user experience: no pain, no pain.) Josh&#8217;s blog is <a href=\"http://globalmoxie.com/blog/\">globalmoxie.com</a>.</p>","twitter":"@@globalmoxie","first_name":"Josh"},{"position":"creator of node.js","picture_url":"/pictures/thumb/missing.png","session_ids":[],"id":35,"last_name":"Dahl","name":"Ryan Dahl","bio":"<p>coming soon.</p>","twitter":"","first_name":"Ryan"},{"position":"co-Author Spring Roo in Action","picture_url":"/system/pictures/44/thumb/gordon.jpg?1295718343","session_ids":[],"id":44,"last_name":"Dickens","name":"Gordon Dickens","bio":"<p>Gordon Dickens has worked in the IT consulting realm for over 15 years. Gordon’s background includes speaking at the recent Groovy and Grails seminar, experience designing and developing a Groovy on Grails application for a chemical company in addition to OSGi, Spring and Hibernate development.</p>\n<p>Gordon blogs at technophile.gordondickens.com and actively tweets about open source technology at twitter.com/gdickens. Gordon is coauthoring Spring Roo in Action (manning.com/dickens) and very active within the SpringFramework, Spring Roo, Spring Integration and Spring Batch projects.  He currently teaches several Spring courses for vmWare/SpringSource and speaks at conferences.</p>\n<p>Gordon has over 20 years as an experienced technical instructor in various technology paradigms. He has applied various technologies including the design, development and testing of applications, object and database modeling within many sectors including: Financial, Pharmaceutical, Chemical and more. Gordon enjoys learning new technologies and sharing knowledge with others. Gordon is actively participating in several technical book reviews.</p>","twitter":"@gdickens","first_name":"Gordon"},{"position":"Spring Integration team lead; co-lead of Spring AMQP","picture_url":"/system/pictures/23/thumb/markfisher.jpg?1292526891","session_ids":[],"id":23,"last_name":"Fisher","name":"Mark  Fisher","bio":"<p>Mark Fisher is an engineer within the SpringSource division of VMware and lead of the Spring Integration team. He is also a committer on the core Spring Framework, co-lead of the Spring <span class=\"caps\">AMQP</span> project, and a contributor of messaging support to the Spring BlazeDS Integration project. Mark is a frequent speaker at conferences and user groups in North America and Europe, and along with other Spring Integration committers, is an author of the forthcoming book, &#8220;Spring Integration in Action&#8221; to be published by Manning.</p>","twitter":"@m_f_   ","first_name":"Mark "},{"position":"contributor to Jasmine, BDD/JS Framework","picture_url":"/system/pictures/17/thumb/coffee_dwf.JPG?1292522052","session_ids":[22],"id":17,"last_name":"Frank","name":"Davis Frank","bio":"<p>Davis is a software engineer and agile coach at Pivotal Labs in San Francisco, where he works on client projects in Rails, HTML5, and Palm webOS. He codes webOS applications as Infews <span class=\"caps\">LLC</span>, maintains Jasmine webOS and is a core contributor to the Jasmine <span class=\"caps\">BDD</span> framework for JavaScript. He loves great barbecue, enjoys the occasional wee dram, and expects live fish to stay in water at all times.</p>","twitter":"@dwfrank","first_name":"Davis"},{"position":"author of DSLs in Action","picture_url":"/system/pictures/8/thumb/debasish.jpg?1292518191","session_ids":[19],"id":8,"last_name":"Ghosh","name":"Debasish Ghosh","bio":"<p>Debasish Ghosh is the chief technology evangelist at <a href=\"http://anshinsoft.com/\">Anshinsoft</a> , where he specializes in leading delivery of enterprise-scale solutions for clients ranging from small to Fortune 500 companies. His research interests are functional programming, domain-specific languages, and NoSQL databases. Debasish received his BS in computer science and engineering from Jadavpur University, India. He’s a senior member of the <span class=\"caps\">ACM</span> and author of the book DSLs In Action, to be published this year by Manning. Read his programming blog at <a href=\"http://debasishg.blogspot.com/\">http://debasishg.blogspot.com</a> and contact him at dghosh@acm.org.</p>","twitter":"@debasishg ","first_name":"Debasish"},{"position":"Senior Data Architect, myYearbook.com","picture_url":"/system/pictures/15/thumb/michaelg.jpg?1292517716","session_ids":[16],"id":15,"last_name":"Glaesemann","name":"Michael Glaesemann","bio":"<p>Michael Glaesemann is a senior data architect at myYearbook.com, developing infrastructure to support a variety of social-networking applications and riding herd over an ever-increasing number of PostgreSQL servers. He&#8217;s been using PostgreSQL since 2003 and has spoken on PostgreSQL at conferences in North America and Japan, and released software to aid in managing large PostgreSQL installations. Relational theory is dear to his heart, and he&#8217;s been increasingly enamoured with functional programming and how the two are related. In his spare time he might be found puzzling together ZeroMQ, Ruby, PostgreSQL, Javascript, and his cottage electrical usage.</p>","twitter":"@grzm","first_name":"Michael"},{"position":"co-author of GWT in Action","picture_url":"/system/pictures/14/thumb/roberthanson.jpg?1292518004","session_ids":[10],"id":14,"last_name":"Hanson","name":"Robert  Hanson","bio":"<p>Robert Hanson is the Manager of Applications Development at Quality Technology Services, where he plays a dual role of lead developer and architect. Robert is a veteran programmer, cutting his teeth on Perl and <span class=\"caps\">ASP</span> in the mid 90’s before embracing Java. Robert has spent over a dozen years developing high-performance web applications, sometimes reaching hundreds of thousands to millions of visitors every day.</p>\n<p>In 2007 Robert co-authored <span class=\"caps\">GWT</span> in Action with Adam Tacy in 2007, and is currently working on the second edition. You can follow his work and ramblings on his blog at <a href=\"http://roberthanson.blogspot.com/\">roberthanson.blogspot.com</a> or visit his home page on the web at <a href=\"http://roberthanson.org/\">roberthanson.org</a> .</p>","twitter":"@iamroberthanson ","first_name":"Robert "},{"position":"co-author of Extreme Programming Installed ","picture_url":"/system/pictures/12/thumb/chethendrickson.jpg?1292518321","session_ids":[18],"id":12,"last_name":"Hendrickson","name":"Chet  Hendrickson","bio":"<p>Chet Hendrickson was at Extreme Programming’s ground zero, the Chrysler Comprehensive Compensation (C3) system. As a developer on the pre-XP C3, Chet saw how poor communication, inadequate testing, and an overly complex design can doom a development effort. He helped make the decision to throw away 14 months of work and begin again under the guidance of Kent Beck, Martin Fowler, and Ron Jeffries. Chet, along with Jim Haungs and Rich Garzaniti, in a talk at OOPSLA’97 i, was the first to report on the ‘Chrysler Methodology’. The ‘Chrysler Methodology’ as the term Extreme Programming had not yet been coined.</p>\n<p>Chet Hendrickson is an author of Extreme Programming Installed. The book, the second in the Extreme Programming series, consists of a connected collection of essays, presented in the order the practices would actually be implemented during a project. He is an independent consultant, coach, and Certified Scrum Trainer.</p>","twitter":"@chethendrickson","first_name":"Chet "},{"position":"Developer Relations, Opera Software","picture_url":"/system/pictures/24/thumb/molly.jpg?1294331337","session_ids":[],"id":24,"last_name":"Holzschlag","name":"Molly Holzschlag","bio":"<p>Having achieved a modicum of balance after her midlife crisis, Molly decided to finally get a job. She is now a Web Evangelist focusing on developer relations for the upstart Norwegian browser company, Opera Software.</p>\n<p>Earlier in life, Molly avoided a regular job including those silly start-up ventures and chose instead to write a lot of books and articles and stuff on Web standards, and talk a lot about them, too. She now avoids the former, while the latter is an ongoing inevitability.</p>\n<p>To learn more about Molly and her work, you can check out her blog at molly.com or interact with her on Twitter @mollydotcom. Better yet, come have a chat F2F in Philly!</p>","twitter":"@mollydotcom","first_name":"Molly"},{"position":"Co-Author of the Agile Manifesto","picture_url":"/system/pictures/25/thumb/ronjeffries.jpg?1292861549","session_ids":[18],"id":25,"last_name":"Jeffries","name":"Ron  Jeffries","bio":"<p>Ron Jeffries is author of Extreme Programming Adventures in C#, the senior author of Extreme Programming Installed, and was the on-site XP coach for the original Extreme Programming project. Ron has been involved with Extreme Programming for over five years, presenting numerous talks and publishing papers on the topic. He is the proprietor of www.XProgramming.com, a well-known source of XP information. Ron was one of the creators, and a featured instructor in Object Mentor’s popular XP Immersion course. He is a well-known independent consultant in XP and Agile methods.</p>\n<p>Ron has advanced degrees in mathematics and computer science, and has been a systems developer for more years than most of you have been alive. His teams have built operating systems, compilers, relational database systems, and a large range of applications. Ron’s software products have produced revenue of over half a billion dollars, and he wonders why he didn’t get any of it.</p>","twitter":"","first_name":"Ron "},{"position":"VP of Engineering for InSTEDD","picture_url":"/system/pictures/19/thumb/eduardo.jpg?1292523003","session_ids":[14],"id":19,"last_name":"Jezierski","name":"Eduardo Jezierski","bio":"<p>Eduardo Jezierski has been a software professional since 1990.  Eduardo is the <span class=\"caps\">CTO</span> of InSTEDD, a non-profit that helps communities around the world use, design and develop information tools for their health, safety and development. This involves diverse tasks like designing and building mobile applications that can be used by almost illiterate users, helping countries like Rwanda and Cambodia architect and implement next-generation health systems, and establishing &#8216;Innovation Labs&#8217; where local folks can own the agile process of delivering tools and services that suit their needs.</p>\n<p>Previously, he helped start the &#8216;patterns &amp; practices&#8217; group at Microsoft, and was its architect for many years. There, he helped enterprise customers by delivering guidance in the form of patterns, books, reference architectures and frameworks; covering mobile, desktop, web apps and web services. In doing so he and his team helped usher in agile practices, and validate the benefits of sharing source code and working with customers in faster iterations, spinning off initiatives like CodePlex and contributing to the evolution of .<span class=\"caps\">NET</span> and Team Foundation Server along the way.</p>\n<p>Ed has published with his team numerous articles and books, and is a regular speaker at international conferences</p>","twitter":"@edjez ","first_name":"Eduardo"},{"position":"creator of jQtouch;  creative director at Sencha","picture_url":"/system/pictures/34/thumb/davidkaneda.png?1294235823","session_ids":[7],"id":34,"last_name":"Kaneda","name":"David Kaneda","bio":"<p>David Kaneda is a designer and developer currently living in Palo Alto.  Last year, David created jQTouch (http://www.jqtouch.com), a Javascript framework for iPhone development. David also maintains WebKitBits (http://www.webkitbits.com), a site about the browser engine in Safari, Google Chrome, and the iPhone. David currently works as creative director at Sencha (http://www.sencha.com), and is responsible for the look and feel of their websites and software, including Sencha Touch (http://www.sencha.com/products/touch).</p>","twitter":"@davidkaneda","first_name":"David"},{"position":"SproutCore project team","picture_url":"/system/pictures/7/thumb/yehudakatz.jpg?1292518041","session_ids":[2,9],"id":7,"last_name":"Katz","name":"Yehuda  Katz","bio":"<p>Yehuda Katz is a member of the Ruby on Rails core team, and in his day job, works on the SproutCore framework. He is a member of the jQuery Core Team, and is currently working on changing the way we write JavaScript applications in the browser. He contributes to many open source projects, like Rubinius, and works on some he created himself, like Thor, Janus and Handlebars.js.</p>","twitter":"@wycats ","first_name":"Yehuda "},{"position":"Distinguished Engineer at Ning","picture_url":"/system/pictures/43/thumb/brianm.jpg?1295631308","session_ids":[25],"id":43,"last_name":"McCallister","name":"Brian McCallister","bio":"<p>Brian McCallister works as a Distinguished Engineer at Ning, the world&#8217;s largest platform for creating social websites. In that capacity he has lead the design and implementation of one of the original Platform as a Service offerings on the Internet, and its technical and product evolution since the beginnings of the company. Brian has also served as a Vice President and Director of the Apache Software Foundation, which develops a wide range of open source software, including the software powering 70% of the World Wide Web. Brian specializes inconsumer Internet systems, the intersection of group social dynamics and technology, and community driven open source.</p>","twitter":"","first_name":"Brian"},{"position":" Maintainer, Jemini JRuby Game Framework","picture_url":"/system/pictures/40/thumb/jay_mcgavren.jpg?1294850734","session_ids":[23],"id":40,"last_name":"McGavren","name":"Jay McGavren","bio":"<p>Jay McGavren is a developer with Choice Hotels.  Though his primary language is Java, he has been working in various scripting languages for over a decade, most recently Ruby.  He is maintainer of the Jemini game framework (https://github.com/jemini), based on JRuby.<br />\nHe also uses JRuby for several smaller open-source game and graphical frameworks (https://github.com/jaymcgavren), and now on Android phones thanks to Ruboto.</p>","twitter":"@jaymcgavren","first_name":"Jay"},{"position":"Chief Engineer, Comcast Interactive Media","picture_url":"/system/pictures/38/thumb/JonMoore.jpg?1294697291","session_ids":[26],"id":38,"last_name":"Moore","name":"Jon  Moore","bio":"<p>Dr. Moore is the Chief Engineer at Comcast Interactive Media (<span class=\"caps\">CIM</span>), a division of Comcast Corporation dedicated to developing and operating online and cross-platform entertainment and media businesses, including: Comcast.net, Fancast.com, and Xfinity.com. He guides technical choices that allow <span class=\"caps\">CIM</span> to bring innovative products to our customers ever more quickly. Moore received his Ph.D. in Computer and Information Science from the University of Pennsylvania and currently lives in<br />\nWest Philadelphia.</p>","twitter":"@jon_moore","first_name":"Jon "},{"position":"author of Effective Enterprise Java; co-author of Professional F#","picture_url":"/system/pictures/26/thumb/tedneward.jpg?1292613555","session_ids":[],"id":26,"last_name":"Neward","name":"Ted Neward","bio":"<p>Ted Neward is an independent consultant specializing in high-scale enterprise systems, working with clients ranging in size from Fortune 500 corporations to small 10-person shops. He is an authority in Java and .<span class=\"caps\">NET</span> technologies, particularly in the areas of Java/.<span class=\"caps\">NET</span> integration (both in-process and via integration tools like Web services), back-end enterprise software systems, and virtual machine/execution engine plumbing.</p>\n<p>He is the author or co-author of several books, including Effective Enterprise Java, C# In a Nutshell, <span class=\"caps\">SSCLI</span> Essentials, Server-Based Java Programming, and a contributor to several technology journals. Ted is also a Microsoft <span class=\"caps\">MVP</span> Architect, <span class=\"caps\">BEA</span> Technical Director, <span class=\"caps\">INETA</span> speaker, former DevelopMentor instructor, frequent worldwide conference speaker, and a member of various Java JSRs. He lives in the Pacific Northwest with his wife, two sons, and eight PCs.</p>","twitter":"@tedneward ","first_name":"Ted"},{"position":"Head of Developer Engagement at Mozilla","picture_url":"/system/pictures/33/thumb/stormy.jpg?1294074321","session_ids":[],"id":33,"last_name":"Peters","name":"Stormy Peters","bio":"<p>Stormy Peters educates companies and communities on how open source software is changing the software industry and how they can best use, interact and participate with open source software projects and companies using open source software.</p>\n<p>She is a passionate speaker who engages her audiences during and after her presentations. She is a frequent keynote speaker on business aspects of Open Source Software at major conferences such as the Open Source Business Conference and the O’Reilly conferences, as well as government organizations such as the United Nations and the European Union.</p>\n<p>Stormy is involved in free and open source software because it is changing the world and the community is full of smart, passionate people!</p>\n<p>Stormy Peters is currently working as Head of Developer Engagement at Mozilla. She also is an advisor for <span class=\"caps\">HFOSS</span>, IntraHealth Open and Open Source for America, as well as founder and president of Kids on Computers, a nonprofit organization setting up computer labs in developing countries.</p>\n<p>She joined Mozilla from the <span class=\"caps\">GNOME</span> Foundation where she served as Executive Director. Previously, she worked at OpenLogic where she set up their OpenLogic Expert Community. Before that, she worked at Hewlett-Packard where she founded and managed the Open Source Program Office that is responsible for HP’s open source strategy, policy and business practices.</p>\n<p>Stormy graduated from Rice University with a B.A. in Computer Science.</p>","twitter":"","first_name":"Stormy"},{"position":"AVP, Change Mangement for Yellowbook","picture_url":"/system/pictures/13/thumb/joerafternicepic.jpg?1292518165","session_ids":[1],"id":13,"last_name":"Rafter","name":"Joe Rafter","bio":"<p>Mr. Rafter is a pioneering business &amp; technology executive, having led global business integration teams across a wide range of industries to improve organizational capability and transform business models. With a business focused approach, he leads corporate enterprises by aligning the business and technology organizations though entrepreneurial thinking, business model innovation, technology delivery, and influential leadership. He currently leads the corporate transformation program for Yellowbook, a 360-degree marketing company that&#8217;s adaptable, innovative and service oriented, offering direct one-to-one consulting and marketing solutions customized for businesses across the country.</p>","twitter":"@jrafter65 ","first_name":"Joe"},{"position":"CIO, Florida State College","picture_url":"/system/pictures/18/thumb/DSCF0009_2_2.jpeg?1292522855","session_ids":[4],"id":18,"last_name":"Rennie","name":"Robert Rennie","bio":"<p>Dr. Rob Rennie has been the Chief Information Officer (<span class=\"caps\">CIO</span>) and Vice President, Technology for Florida State College at Jacksonville, Florida since 1997.</p>\n<p>Prior to taking his current position, he was the <span class=\"caps\">CIO</span> for Mt. San Antonio College in Los Angeles, is a former principal of the technology strategy practice of Xentrek Systems, Inc. and held a visiting scholar faculty appointment in Information Systems at the John E. Anderson Graduate School of Management at <span class=\"caps\">UCLA</span>. Rob has been a <span class=\"caps\">CIO</span> for over twenty years and is known for building the reputations of organizations on a foundation of innovation, value creation, excellence and technology leadership. Dr. Rennie serves on Software AG&#8217;s International Executive Committee, is a member of Apple&#8217;s University Executive Forum and is a board member of Curriki.</p>\n<p>Florida State College has won numerous awards for its highly innovative and successful technology environment having been ranked first in the Nation three of four years by the Center for Digital Education, rated &#8216;Most Wired&#8217; by Yahoo, and having been featured by several major technology firms for best practices and successful innovations and was named a Computerworld Gold Laureate in 2008.</p>\n<p>In 2004, Dr. Rennie was honored as one of Computerworld&#8217;s Premier 100 IT leaders. Rob received his Bachelors degree from Rollins College, Masters from The University of Oklahoma, and Ph.D. from the University of Florida.</p>","twitter":"","first_name":"Robert"},{"position":"Head of Cloud Development, SpringSource","picture_url":"/system/pictures/5/thumb/chrisrichardson.jpg?1292518071","session_ids":[8],"id":5,"last_name":"Richardson","name":"Chris Richardson","bio":"<p>Chris Richardson is a developer and architect with over 20 years of experience. He is a Java Champion and the author of POJOs in Action, which describes how to build enterprise Java applications with POJOs and lightweight frameworks such as Spring and Hibernate. Chris is the founder of CloudFoundry.com and the Head of Cloud Computing at SpringSource, a division of VMware. He lives in Oakland, CA with his wife and three children.</p>","twitter":"@crichardson ","first_name":"Chris"},{"position":"co-author of Spring Roo in Action","picture_url":"/system/pictures/10/thumb/krimple-wiki.jpg?1292517748","session_ids":[24],"id":10,"last_name":"Rimple","name":"Ken Rimple","bio":"<p>Ken Rimple is the Director of Education for Chariot Solutions. His team delivers training and mentoring in a wide variety of subjects including Spring, Maven, OSGi, Groovy/Grails, Rails and Flex. He has worked in Java since version 1.0.2 in the 1990s. His background in databases is even longer than his Java experience, as the first relational database he worked with was Oracle back in 1991 (remember when ER/Win fit on two floppy discs)? Ken has co-chaired several Chariot conferences, including <span class=\"caps\">ETE</span> 2009 and 2010, Cloud-Con East in 2008, and the Philly Grails Conference in 2009. He is also the host and creator of the Chariot TechCast podcast series, which aims to deliver information about projects and developers in the open source community both here in Philadelphia and internationally as well. Ken has a wife, four children, two dogs and a dull headache.</p>","twitter":"@krimple","first_name":"Ken"},{"position":"author of The Patterns Handbook; co-author of Fearless Change","picture_url":"/system/pictures/6/thumb/lindarising.jpg?1292518091","session_ids":[11],"id":6,"last_name":"Rising","name":"Linda Rising","bio":"<p>Linda Rising has a Ph.D. from Arizona State University in the area of object-based design metrics. Her background includes university teaching as well as work in industry in telecommunications, avionics, and strategic weapons systems. She is an internationally known presenter on topics related to patterns, retrospectives, and the change process. Linda is the author of numerous articles and has published four books: Design Patterns in Communications, The Pattern Almanac 2000, and A Patterns Handbook. Her latest book, written with Mary Lynn Manns, is titled Fearless Change: Patterns for introducing new ideas. Her web site is: <a href=\"http://lindarising.org/\">www.lindarising.org</a>.</p>","twitter":"","first_name":"Linda"},{"position":"author of Manage It! Your Guide to Modern, Pragmatic Project Management","picture_url":"/system/pictures/27/thumb/Johanna.Rothman.jpg?1292535796","session_ids":[],"id":27,"last_name":"Rothman","name":"Johanna Rothman","bio":"<p>Johanna Rothman helps managers and leaders solve problems and seize opportunities.</p>\n<p>She consults, speaks, and writes on managing high-technology product development. She enables managers, teams, and organizations to become more effective by applying her pragmatic approaches to the issues of project management, risk management, and people management.</p>\n<p>Johanna publishes The Pragmatic Manager, a monthly email newsletter and podcast, and writes two blogs: Managing Product Development and Hiring Technical People. She is the author of several books: &#8211; Manage Your Project Portfolio: Increase Your Capacity and Finish More Projects &#8211; 2008 Jolt Productivity award winning Manage It! Your Guide to Modern, Pragmatic Project Management &#8211; Behind Closed Doors: Secrets of Great Management (with Esther Derby) &#8211; Hiring the Best Knowledge Workers, Techies &amp; Nerds: The Secrets and Science of Hiring Technical People &#8211; Corrective Action for the Software Industry (with Denise Robitaille).</p>\n<p>Johanna is also a host and session leader at the Amplifying Your Effectiveness<br />\nConference. Find more of Johanna&#8217;s articles and her blogs at <a href=\"http://jrothman.com/\">www.jrothman.com</a>.</p>","twitter":"@johannarothman ","first_name":"Johanna"},{"position":"JRuby Core Team Member","picture_url":"/system/pictures/4/thumb/Nick_Sieger.jpg?1292517644","session_ids":[],"id":4,"last_name":"Sieger","name":"Nick Sieger","bio":"<p>Nick Sieger is an engineer at Engine Yard, working on JRuby and leading the effort to make the Java Virtual Machine a robust yet easy-to-use deployment platform for Rails and Ruby web applications. He created and co-maintains the <span class=\"caps\">JDBC</span> adapter for ActiveRecord that JRuby on Rails uses for database connectivity, as well as the Warbler tool and JRuby-Rack library for dealing with Java application server deployment. He maintains a blog on Ruby and JRuby-related topics at <a href=\"http://blog.nicksieger.com/\">http://blog.nicksieger.com/</a>.</p>","twitter":"@nicksieger","first_name":"Nick"},{"position":"Clojure/core team member","picture_url":"/system/pictures/37/thumb/stuartsierra.jpg?1294422317","session_ids":[27],"id":37,"last_name":"Sierra","name":"Stuart Sierra","bio":"<p>Stuart Sierra is a developer at Relevance, a member of Clojure/core, and the co-author of Practical Clojure (Apress, 2010). He is heavily involved in the development of Clojure and has written numerous open-source libraries. Prior to 2010, he worked at Columbia Law School on AltLaw, a groundbreaking open-source search engine for legal scholarship, making use of Hadoop, Lucene, and semantic web technologies. Stuart lives in New York City.</p>","twitter":"@stuartsierra","first_name":"Stuart"},{"position":"Global Demand Manager Health Services, Siemens HealthCare","picture_url":"/system/pictures/28/thumb/marksilver.jpg?1295286449","session_ids":[12],"id":28,"last_name":"Silver","name":"Mark  Silver","bio":"<p>Mark Silver is an international business executive with global experience managing all major corporate functions from knowledge management, process management, compliance, finance, and HR to marketing and public relations. In 2003, Mark moved from Australia to become the Chief Information Security Officer for Siemens covering its diverse operating interests for the Americas. After leading the team of 190 professionals to achieve the internal corporate security goals, Mark joined Siemens HealthCare and became the divisional Chief Information Officer for Health Services, the global health information systems solutions provider. Currently, he is part of the global Siemens HealthCare IT team in customer relations. An active board member of not for profit organizations, he is also a member of the Temple University School of Science and Technology Advisory Board and part of the management team of the Greater Philadelphia Senior Executive Group. Mark is using his professional background and Master of Business degree from the Queensland University of Technology to help him write a book that helps business understand and leverage social media.</p>","twitter":"","first_name":"Mark "},{"position":"Enterprise Architect at Chariot Solutions","picture_url":"/pictures/thumb/missing.png","session_ids":[],"id":30,"last_name":"Sklyut","name":"Dmitry Sklyut","bio":"<p>coming soon</p>","twitter":"","first_name":"Dmitry"},{"position":"author, Erlang in Practice screencasts","picture_url":"/pictures/thumb/missing.png","session_ids":[],"id":31,"last_name":"Smith","name":"Kevin  Smith","bio":"<p>Kevin discovered Erlang in 2006 after spending years in the wilderness developing complex systems in Java. He&#8217;s never looked back since. He is the author of the Pragmatic Programmer&#8217;s &#8220;Erlang In Practice&#8221; series and has worked on a number of commercial Erlang projects. Kevin is currently a software engineer at Heroku where he uses his Erlang powers only for good.</p>","twitter":"","first_name":"Kevin "},{"position":"writer of Scala for Java Refugees","picture_url":"/system/pictures/39/thumb/daniels.jpg?1294850168","session_ids":[20],"id":39,"last_name":"Spiewak","name":"Daniel Spiewak","bio":"<p>Daniel Spiewak is a software developer based out of Wisconsin, <span class=\"caps\">USA</span>. Over the years, he has worked with Java, Scala, Ruby, C/C++, ML, Clojure and several experimental languages. He currently spends most of his free time researching parser theory and methodologies, particularly areas where the field intersects with functional language design, domain-specific languages and type theory.</p>\n<p>Daniel has written a number of articles on his weblog, Code Commit, including his popular introductory series, Scala for Java Refugees.</p>","twitter":"","first_name":"Daniel"},{"position":"author of Building iPhone Apps with HTML, CSS, and JavaScript","picture_url":"/system/pictures/2/thumb/jonathanstark-scarf_bigger.jpg?1292518534","session_ids":[],"id":2,"last_name":"Stark","name":"Jonathan Stark","bio":"<p>Jonathan Stark is a mobile application consultant who the Wall Street Journal has called an expert on publishing desktop data to the web.</p>\n<p>He is the author of O&#8217;Reilly&#8217;s Building iPhone Apps with <span class=\"caps\">HTML</span>, <span class=\"caps\">CSS</span>, and JavaScript, is a frequent speaker at industry conferences, and is often quoted in the media on internet and mobile lifestyle trends.</p>\n<p>Jonathan began his programming career more than 20 years ago on a Tandy <span class=\"caps\">TRS</span>-80 and still thinks Zork was a sweet game.</p>","twitter":"@jonathanstark","first_name":"Jonathan"},{"position":"Chief Technology Officer, Mission Services at Accenture ","picture_url":"/system/pictures/29/thumb/Jim_Stogdill_bio.jpg?1294236592","session_ids":[],"id":29,"last_name":"Stogdill","name":"Jim Stogdill","bio":"<p>Jim Stogdill is <span class=\"caps\">CTO</span> of Accenture&#8217;s Mission Services group.  He focuses on the concept of Intentional Emergence &#8211; bringing the vibrancy and innovation of the web to the large enterprise by enabling innovation at its edges.  To that end he encourages agile software development, platform thinking, generativetechnology policy, and the development of open source software in government and defense. In previous lives he built B2B reverse auction systems, brought heuristic-based optimization and online trading to the corporate treasury, and traveled the world as a Navy Officer. Unfortunately from his vantage point it all looked like the inside of a submarine. He spends his free time hacking silver halides with decidedly low-tech gear. He can be found on twitter as @jstogdill and blogs at radar.oreilly.com/jims and www.limnthis.com</p>","twitter":"@jstogdill","first_name":"Jim"},{"position":"author of Seven Languages in Seven Weeks","picture_url":"/system/pictures/9/thumb/bruce_tate_reduced.jpg?1292518581","session_ids":[5],"id":9,"last_name":"Tate","name":"Bruce Tate","bio":"<p>Bruce Tate is a kayaker, mountain biker, and father of two from Austin, Texas. The author of more than ten books including Seven Languages in Seven Weeks, Beyond Java, and From Java to Ruby.</p>\n<p>Bruce founded RapidRed, a consultancy that has built several large websites including DigtheDirt, ChangingThePresent, ClassWish, and several others from the ground up. His company uses small teams with productive processes and technologies to rapidly put quality products into the marketplace. Earlier, Bruce served as the <span class=\"caps\">CTO</span> of WellGood, a company that builds software for nonprofits, and as a developer and architect at <span class=\"caps\">IBM</span>.</p>","twitter":"@redrapids","first_name":"Bruce"},{"position":"Creator of the Ruby build tool, rake","picture_url":"/system/pictures/16/thumb/jim_jdd_portrait-750x1000.jpg?1292521816","session_ids":[21],"id":16,"last_name":"Weirich","name":"Jim Weirich","bio":"<p>Jim Weirich is the Chief Scientist for EdgeCase <span class=\"caps\">LLC</span>, a Rails development firm located in Columbus Ohio. Jim has over twenty-five years of experience in software development.  He has worked with real-time data systems for testing jet engines, networking software for information systems, and image processing software for the financial industry. Jim is active in the Ruby community and has contributed to several Ruby projects, including the Rake build system and the RubyGems package software.</p>","twitter":"@jimweirich","first_name":"Jim"}]